package com.http.util;


/**
 * 
 * @ClassName: ErrorMsg.java
 * @Description: 错误提示语
 * @author huanghc
 * @date 2018年3月19日 下午3:21:27
 */
public class ErrorMsg {

	//成功
	public static final String SUCCESS = "000000";
	/**
	 * 
	 * @ClassName: MobileService
	 * @Description:
	 * @author huanghc
	 * @date 2018年3月19日 下午3:21:27
	 */
	public enum MobileService {
		
		M000000("000000","请求成功"),
		//----------------- 1：请求参数错误----------------------------
		M100000("100000","请求参数不能为空"),
		M100001("100000","请输入手机号码"),
		M100002("100000","证件类型格式错误"),
		M100003("100000","请输入证件号码"),
		M100004("100000","证件号码格式错误，请重新输入"),
		M100005("100000","请输入姓名"),
		
		
		//----------------- 2：业务逻辑错误----------------------------
		M200001("200001","用户名或密码错误"),
		M200002("200002","用户已删除或者失效"),
		//----------------- 3：数据检查错误----------------------------
		M300001("300001","openId不能为空"),
		M300002("300002","微信头像不能为空"),
		M300003("300003","微信名称不能为空"),
		M300004("300004","孩子数量不能全部为空"),
		M300005("300005","id不能为空"),
		M300006("300006","课程类型不能为空"),
		M300007("300007","课程标签不能为空"),
		M300008("300008","课程名称不能为空"),
		M300009("300009","关联id不能为空"),
		M300010("300010","时间提醒不能为空"),
		M300011("300011","formId不能为空"),
		M300012("300012","模板id不能为空"),
		M300013("300013","课程关联id不能为空"),
		M300014("300014","起始时间不能为空"),
		M300015("300015","开课时间不能为空"),
		M300016("300016","课堂结束时间不能为空"),
		M300017("300017","课堂提醒时间不能为空"),
		M300018("300018","课堂提醒类型不能为空"),
		M300019("300019","星期几不能为空"),
		M300020("300020","孩子关联id不能为空"),
		M300021("300021","手机号码不能为空"),
		M300022("300022","短信签名不能为空"),
		M300023("300023","短信模板不能为空"),
		M300024("300024","验证码唯一标识不能为空"),
		M300025("300025","验证码不能为空"),
		M300026("300026","验证码失效或错误"),
		M300027("300027","课程id为空时,课程标签不能为空"),
		M300028("300028","课程id为空时,课程类型不能为空"),
		M300029("300029","课程id为空时,孩子id不能为空"),
		M300030("300030","该用户已被注册"),
		M300031("300031","该用户已开启宝贝计划"),
		M300032("300032","该用户未开启宝贝计划"),
		M300033("300033","该用户未被注册"),
		M300034("300034","孩子性别不能为空"),
		M300035("300035","数据为空"),
		M300036("300036","该用户已注册"),
		M300037("300037","该用户今天已登录"),
		M300038("300038","该用户今天未登录"),
		//MobileService.M900000.getErrCode());
		//----------------- 9：其他错误（会话超时，客户端版本异常...）-------------
		M900001("900001","请求异常"),
		M900006("900006","客户端参数有误");
		
		
		
		//错误码
		private String errCode;
		//错误信息
		private String errMsg;


		public String getErrCode() {
			return errCode;
		}

		public String getErrMsg() {
			return errMsg;
		}

		private MobileService(String errCode, String errMsg) {
			this.errCode = errCode;
			this.errMsg = errMsg;
		}

		public static String getMsgByCode(String errCode) {
			for (MobileService ms : MobileService.values()) {
				if (ms.errCode .equals(errCode)) {
					return ms.errMsg;
				}
			}
			return null;
		}

	}
	public static void main(String[] args) {
		System.out.println(MobileService.getMsgByCode("100000"));
	}
	
}
